In [1]:
import pymysql

In [2]:
import pandas as pd

In [3]:
conn=pymysql.connect(host='localhost',port=int(3306),user='root',passwd='Ofhani3mukwevho@',db='data_science')

In [4]:
df_post = pd.read_sql_query('select * from job_posting ', conn)
df_post.head()

,job_id,company,industry,closing_date,post_level,post_type,post_qualification,post_skills,post_description,post_min_experience,post_salary,work_environment,post_city
0,1,DHL,Logistics,2022-06-01,Intermediate,Permanent,Bachelor Degree,Power BI and Azure,"Gather, manipulate and analyze data from diffe...",3,25000,remote,Kempton Park

In [5]:
df_user = pd.read_sql_query ('select * from applicant_table', conn)
df_user.head()

,applicant_id,first_name,surname,current job,company,current salary,qualification,graudation_date,skills,position_of_interest
0,1,ofhani,mukwevho,student,explore data science academy,5000.0,data science,2022-06-01,"SQL,Power Bi, AWS",Junior Business Analyst
1,2,Gudani,Mbedzi,None,None,NaN,None,None,None,None
2,3,Gudani,Mbedzi,None,None,NaN,None,None,None,None
3,4,gudani,bedzi,None,None,NaN,None,None,None,None

In [6]:
import mysql.connector 

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Ofhani3mukwevho@",
  database="data_science"
)

mycursor = mydb.cursor()

sql ="INSERT INTO applicant_table (first_name, surname) VALUES (%s, %s)"

val =("gudani ", "bedzi")

mycursor.execute(sql, val)

mydb.commit()

print(mycursor.rowcount, "record inserted.")

1 record inserted.

In [7]:
df_user.head()

,applicant_id,first_name,surname,current job,company,current salary,qualification,graudation_date,skills,position_of_interest
0,1,ofhani,mukwevho,student,explore data science academy,5000.0,data science,2022-06-01,"SQL,Power Bi, AWS",Junior Business Analyst
1,2,Gudani,Mbedzi,None,None,NaN,None,None,None,None
2,3,Gudani,Mbedzi,None,None,NaN,None,None,None,None
3,4,gudani,bedzi,None,None,NaN,None,None,None,None

In [1]:
%load_ext sql

In [2]:
%%sql 
sqlite:///data_science.db

In [4]:
%%sql

SELECT company from job_posting

 * sqlite:///data_science.db
(sqlite3.OperationalError) no such table: job_posting
[SQL: SELECT company from job_posting]
(Background on this error at: http://sqlalche.me/e/14/e3q8)